hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node/src/Aquaponic_LoRa_Transmitter.cpp
#include <Arduino.h>
#include <SPI.h>
#include <LoRa.h>
#include <WiFi.h>
#include <WebServer.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <vector>
#include <algorithm>
#include <cmath>
#include <DHT.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <mbedtls/aes.h>
#include "SmartPacket.h"

// ================= FORWARD DECLARATIONS =================
float readPH(int raw);
float readTDS(int raw);
String readTurbidity(int raw);
String canonicalSensorName(String sensor);
void handleSerialCommand(String input);
String getFieldValue(const String &data, const String &key);
String getHardwareId();
bool decryptStructuredPacket(const std::vector<uint8_t> &input, SmartPacket::Header &header, String &payload);
void handleIncomingControl();

// ================= SETTINGS =================
// NOTE: AES key and Auth key are now stored in flash Preferences
// Use serial commands to set them: SETKEYS,AES128=xxx,AUTH=yyy
// Or use Flutter app to deploy via /config endpoint
const char *ssid = "AQUA_NODE";
const char *password = "12345678";

// Runtime key storage (loaded from flash at startup)
String runtimeAesKey = "SmartPonic123456";  // Default fallback
String runtimeAuthKey = "AQUA77";          // Default fallback

WebServer server(80);
Preferences prefs;
bool loraReady = false;
uint32_t packetSeq = 0;  // Sequence counter for data integrity
String runtimeHardwareId = "";
const char *nodeKeyHeader = "X-Node-Key";
const char *configNamespace = "cfg";
const char *configJsonPrefKey = "json";
const char *nodeSecurityPrefKey = "node_key";
const char *aesKeyPrefKey = "aes_key";
const char *authKeyPrefKey = "auth_key";

// ADD THIS: smart communication timing profile
constexpr unsigned long SAMPLE_INTERVAL_MS = 5000UL;
constexpr unsigned long REPORT_INTERVAL_NORMAL_MS = 15UL * 60UL * 1000UL;
constexpr unsigned long REPORT_INTERVAL_ABNORMAL_MS = 5UL * 60UL * 1000UL;
constexpr unsigned long REPORT_INTERVAL_CRITICAL_MS = 60UL * 1000UL;
constexpr unsigned long RETRY_INTERVAL_MS = 30000UL;
constexpr size_t MAX_PENDING_PACKETS = 12;

// LoRa Pins
#define LORA_SCK 18
#define LORA_MISO 19
#define LORA_MOSI 23
#define LORA_SS 5
#define LORA_RST 14
#define LORA_DIO0 -1
#define LORA_SYNC_WORD 0xB4
// NOTE: runtimeAuthKey replaces the old SECRET_KEY constant
// Update references to use runtimeAuthKey variable

struct GPIOConfig {
  int pin;
  String type;
  String sensor;
  String label;
};

// ADD THIS: node-side metadata provided by the app / range testing workflow
struct NodeRuntimeSettings {
  // nodeId is fixed at 0 for all nodes - hardwareId (from ESP32 eFuse MAC)
  // is used as the unique identifier in the encrypted payload
  uint8_t nodeId = 0;
  float latitude = 0.0f;
  float longitude = 0.0f;
  float distanceMeters = 0.0f;
};

// ADD THIS: cache sampled values every 5 seconds
struct SensorSegment {
  String segment;
  String sensorName;
  String rawValue;
  int pin;
};

// ADD THIS: FIFO retry queue item for failed LoRa packets
struct PendingPacket {
  std::vector<uint8_t> bytes;
  uint8_t priority;
  uint8_t reportMode;
  uint32_t sequence;
  unsigned long queuedAtMs;
};

std::vector<GPIOConfig> configList;
std::vector<SensorSegment> latestSegments;
std::vector<PendingPacket> pendingPackets;
NodeRuntimeSettings runtimeSettings;
#define MAX_SENSORS 15

// Sensor Pointers
DHT *dhtSensors[MAX_SENSORS];
OneWire *oneWireSensors[MAX_SENSORS];
DallasTemperature *tempSensors[MAX_SENSORS];

unsigned long lastSampleMs = 0;
unsigned long lastReportMs = 0;
unsigned long lastRetryMs = 0;
bool criticalDispatchPending = false;
bool metadataSyncPending = false;
uint8_t currentPriority = SmartPacket::PRIORITY_LOW;
uint8_t currentReportMode = SmartPacket::REPORT_MODE_NORMAL;
unsigned long currentReportIntervalMs = REPORT_INTERVAL_NORMAL_MS;

const int safePins[] = {
    4,  13, 16, 17, 21, 22, 25, 26,
    27, 32, 33, 34, 35, 36, 39,
};

bool isSafePin(int pin) {
  for (size_t i = 0; i < sizeof(safePins) / sizeof(safePins[0]); i++) {
    if (safePins[i] == pin) {
      return true;
    }
  }
  return false;
}

String boardName() {
#if defined(CONFIG_IDF_TARGET_ESP32S3)
  return "ESP32-S3 Dev Module";
#elif defined(CONFIG_IDF_TARGET_ESP32S2)
  return "ESP32-S2 Dev Module";
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
  return "ESP32-C3 Dev Module";
#elif defined(CONFIG_IDF_TARGET_ESP32)
  return "ESP32 Dev Module";
#else
  return "ESP32";
#endif
}

String getHardwareId() {
  uint64_t mac = ESP.getEfuseMac();
  uint8_t macBytes[6];
  for (int i = 0; i < 6; i++) {
    macBytes[5 - i] = (uint8_t) ((mac >> (8 * i)) & 0xFF);
  }

  char eui64[17];
  snprintf(
      eui64,
      sizeof(eui64),
      "%02X%02X%02XFFFE%02X%02X%02X",
      macBytes[0],
      macBytes[1],
      macBytes[2],
      macBytes[3],
      macBytes[4],
      macBytes[5]);
  return String(eui64);
}

void addCommonHeaders() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type, X-Node-Key");
  server.sendHeader("Cache-Control", "no-store");
}

String loadNodeSecurityKey() {
  prefs.begin(configNamespace, true);
  String value = prefs.getString(nodeSecurityPrefKey, "");
  prefs.end();
  return value;
}

void saveNodeSecurityKey(const String &value) {
  prefs.begin(configNamespace, false);
  prefs.putString(nodeSecurityPrefKey, value);
  prefs.end();
}

// ================= SECURE KEY STORAGE =================
// Keys are stored in ESP32 flash via Preferences namespace "secrets"
// This provides secure, persistent storage separate from config namespace

void loadSecureKeys() {
  prefs.begin("secrets", true);
  runtimeAesKey = prefs.getString(aesKeyPrefKey, "");
  runtimeAuthKey = prefs.getString(authKeyPrefKey, "");
  prefs.end();

  if (runtimeAesKey.length() == 0) {
    runtimeAesKey = "SmartPonic123456";
    Serial.println("WARNING: Using default AES key - set custom key with SETKEYS command");
  }
  if (runtimeAuthKey.length() == 0) {
    runtimeAuthKey = "AQUA77";
    Serial.println("WARNING: Using default Auth key - set custom key with SETKEYS command");
  }

  Serial.println("Secure keys loaded from flash storage");
  Serial.print("AES key configured: ");
  Serial.println(runtimeAesKey.length() > 0 ? "YES" : "NO");
  Serial.print("Auth key configured: ");
  Serial.println(runtimeAuthKey.length() > 0 ? "YES" : "NO");
}

bool saveAesKey(const String &value) {
  if (value.length() != 16) {
    Serial.println("ERROR: AES key must be exactly 16 characters");
    return false;
  }
  prefs.begin("secrets", false);
  prefs.putString(aesKeyPrefKey, value);
  prefs.end();
  runtimeAesKey = value;
  Serial.println("AES key saved to flash storage");
  return true;
}

