hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node/src/Aquaponic_LoRa_Transmitter.cpp
bool saveAuthKey(const String &value) {
  if (value.length() == 0 || value.length() > 64) {
    Serial.println("ERROR: Auth key must be 1-64 characters");
    return false;
  }
  prefs.begin("secrets", false);
  prefs.putString(authKeyPrefKey, value);
  prefs.end();
  runtimeAuthKey = value;
  Serial.println("Auth key saved to flash storage");
  return true;
}

bool clearSecureKeys() {
  prefs.begin("secrets", false);
  prefs.remove(aesKeyPrefKey);
  prefs.remove(authKeyPrefKey);
  prefs.end();
  runtimeAesKey = "SmartPonic123456";
  runtimeAuthKey = "AQUA77";
  Serial.println("Secure keys cleared - using defaults");
  return true;
}

String readRequestSecurityKey() {
  String requestKey;

  if (server.hasHeader(nodeKeyHeader)) {
    requestKey = server.header(nodeKeyHeader);
  }

  if (requestKey.isEmpty() && server.hasArg("key")) {
    requestKey = server.arg("key");
  }

  requestKey.trim();
  return requestKey;
}

bool requireAuthorizedNodeKey(bool allowBootstrap) {
  String requestKey = readRequestSecurityKey();
  String nodeKey = loadNodeSecurityKey();

  if (requestKey.isEmpty()) {
    addCommonHeaders();
    server.send(
        401,
        "application/json",
        "{\"status\":\"missing_key\",\"message\":\"Security key required\"}");
    return false;
  }

  if (nodeKey.isEmpty()) {
    if (allowBootstrap) {
      return true;
    }

    addCommonHeaders();
    server.send(
        403,
        "application/json",
        "{\"status\":\"key_not_configured\",\"message\":\"Set a key with a deploy request first\"}");
    return false;
  }

  if (requestKey != nodeKey) {
    addCommonHeaders();
    server.send(
        403,
        "application/json",
        "{\"status\":\"invalid_key\",\"message\":\"Security key mismatch\"}");
    return false;
  }

  return true;
}

// ADD THIS: sensor/communication prioritization helpers
uint8_t escalatePriority(uint8_t current, uint8_t candidate) {
  return candidate > current ? candidate : current;
}

uint8_t classifySensorPriority(const String &sensorName, const String &rawValue) {
  String trimmed = rawValue;
  trimmed.trim();

  if ((sensorName == "Temperature" || sensorName == "Humidity") && trimmed.equalsIgnoreCase("nan")) {
    return SmartPacket::PRIORITY_HIGH;
  }

  if (sensorName == "WaterTemp" && trimmed.toFloat() == -127.0f) {
    return SmartPacket::PRIORITY_HIGH;
  }

  if (!trimmed.equalsIgnoreCase("nan")) {
    const float value = trimmed.toFloat();

    if (sensorName == "Temperature") {
      if (value < 18.0f || value > 35.0f) return SmartPacket::PRIORITY_HIGH;
      if (value < 22.0f || value > 32.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "Humidity") {
      if (value < 30.0f || value > 90.0f) return SmartPacket::PRIORITY_HIGH;
      if (value < 40.0f || value > 80.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "WaterTemp") {
      if (value < 15.0f || value > 32.0f) return SmartPacket::PRIORITY_HIGH;
      if (value < 20.0f || value > 30.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "pH") {
      if (value < 5.5f || value > 8.5f) return SmartPacket::PRIORITY_HIGH;
      if (value < 6.0f || value > 8.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "TDS") {
      if (value > 1200.0f) return SmartPacket::PRIORITY_HIGH;
      if (value > 800.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "Turbidity") {
      if (value > 1000.0f) return SmartPacket::PRIORITY_HIGH;
      if (value > 300.0f) return SmartPacket::PRIORITY_MEDIUM;
    } else if (sensorName == "Rain") {
      if ((int) value == 1) return SmartPacket::PRIORITY_MEDIUM;
    }
  }

  return SmartPacket::PRIORITY_LOW;
}

void updateReportMode(uint8_t priority) {
  currentPriority = priority;

  if (priority == SmartPacket::PRIORITY_HIGH) {
    currentReportMode = SmartPacket::REPORT_MODE_CRITICAL;
    currentReportIntervalMs = REPORT_INTERVAL_CRITICAL_MS;
    criticalDispatchPending = true;
  } else if (priority == SmartPacket::PRIORITY_MEDIUM) {
    currentReportMode = SmartPacket::REPORT_MODE_ABNORMAL;
    currentReportIntervalMs = REPORT_INTERVAL_ABNORMAL_MS;
  } else {
    currentReportMode = SmartPacket::REPORT_MODE_NORMAL;
    currentReportIntervalMs = REPORT_INTERVAL_NORMAL_MS;
  }
}

String canonicalSensorName(String sensor) {
  sensor.trim();
  String normalized = sensor;
  normalized.toUpperCase();

  if (normalized == "DHT22") return "DHT22";
  if (normalized == "WATERTEMP") return "WaterTemp";
  if (normalized == "PH") return "pH";
  if (normalized == "TDS") return "TDS";
  if (normalized == "TURBIDITY") return "Turbidity";
  if (normalized == "RAIN") return "Rain";

  return sensor;
}

// ================= CONFIG LOGIC =================

void applyConfig(JsonArray arr) {
  for (int i = 0; i < MAX_SENSORS; i++) {
    if (dhtSensors[i]) {
      delete dhtSensors[i];
      dhtSensors[i] = nullptr;
    }
    if (tempSensors[i]) {
      delete tempSensors[i];
      tempSensors[i] = nullptr;
      delete oneWireSensors[i];
      oneWireSensors[i] = nullptr;
    } else if (oneWireSensors[i]) {
      delete oneWireSensors[i];
      oneWireSensors[i] = nullptr;
    }
  }

  configList.clear();
  int idx = 0;

  for (JsonObject obj : arr) {
    if (idx >= MAX_SENSORS) {
      break;
    }

    int pin = obj["pin"] | -1;
    String sensor = canonicalSensorName(obj["sensor"] | "");
    String type = obj["type"] | "";
    String label = obj["label"] | "";
    label.trim();

    if (!isSafePin(pin)) {
      continue;
    }

    bool duplicate = false;
    for (size_t existingIndex = 0; existingIndex < configList.size(); existingIndex++) {
      if (configList[existingIndex].pin == pin && configList[existingIndex].sensor == sensor) {
        duplicate = true;
        break;
      }
    }
    if (duplicate) {
      continue;
    }

    configList.push_back({pin, type, sensor, label});

    if (sensor == "DHT22") {
      dhtSensors[idx] = new DHT(pin, DHT22);
      dhtSensors[idx]->begin();
    } else if (sensor == "WaterTemp") {
      oneWireSensors[idx] = new OneWire(pin);
      tempSensors[idx] = new DallasTemperature(oneWireSensors[idx]);
      tempSensors[idx]->begin();
    }

    if (type == "DO") {
      pinMode(pin, OUTPUT);
    } else {
      pinMode(pin, INPUT);
    }

    Serial.print("Configured GPIO ");
    Serial.print(pin);
    Serial.print(" as ");
    if (!label.isEmpty()) {
      Serial.print(label);
      Serial.print(" ");
    }
    Serial.print(sensor);
    Serial.print(" [");
    Serial.print(type);
    Serial.println("]");

    idx++;
  }
}

void loadRuntimeSettingsFromDocument(JsonDocument &doc) {
  runtimeSettings.nodeId = (uint8_t) max(1, (int) ((int) (doc["nodeId"] | runtimeSettings.nodeId)));
  runtimeSettings.latitude = doc["latitude"] | runtimeSettings.latitude;
  runtimeSettings.longitude = doc["longitude"] | runtimeSettings.longitude;
  runtimeSettings.distanceMeters = doc["distance"] | runtimeSettings.distanceMeters;
}

void handleRoot() {
  Serial.println("HTTP GET /");
  addCommonHeaders();

  String html =
      "<!doctype html><html><head><meta name='viewport' "
      "content='width=device-width,initial-scale=1'>"
      "<title>SmartPonic Node</title>"
      "<style>"
      "body{font-family:Arial,sans-serif;background:#f5f8f5;color:#17312a;"
      "padding:24px;line-height:1.5;}"
      ".card{max-width:560px;background:#ffffff;border-radius:20px;"
      "padding:20px;box-shadow:0 14px 30px rgba(23,49,42,0.10);}"
      "code{background:#eef4ef;padding:2px 6px;border-radius:8px;}"
      "a{color:#0d7a49;text-decoration:none;font-weight:600;}"
      "h1{margin:0 0 10px;font-size:28px;}"
      "p{margin:8px 0;}"
      "ul{padding-left:18px;}"
      "</style></head><body><div class='card'>"
      "<h1>SmartPonic Node</h1>"
      "<p>Wi-Fi AP is running and the local web server is alive.</p>"
      "<p><strong>SSID:</strong> <code>" +
      String(ssid) +
      "</code></p>"
      "<p><strong>IP:</strong> <code>" +
      WiFi.softAPIP().toString() +
      "</code></p>"
      "<p><strong>Locked:</strong> <code>" +
      String(loadNodeSecurityKey().isEmpty() ? "no" : "yes") +
      "</code></p>"
      "<p><strong>Hardware ID:</strong> <code>" +
      runtimeHardwareId +
      "</code></p>"
      "<p><strong>LoRa address:</strong> <code>" +
      String(runtimeSettings.nodeId) +
      "</code></p>"
      "<p><strong>Distance:</strong> <code>" +
      String(runtimeSettings.distanceMeters, 1) +
      " m</code></p>"
      "<p><strong>Clients:</strong> <code>" +
      String(WiFi.softAPgetStationNum()) +
      "</code></p>"
      "<ul>"
      "<li><a href='/health'>/health</a> for quick JSON status</li>"
      "<li><a href='/config'>/config</a> for saved config JSON</li>"
      "</ul>"
      "</div></body></html>";

  server.send(200, "text/html", html);
}

