hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node/src/Aquaponic_LoRa_Transmitter.cpp
void handleHealth() {
  Serial.println("HTTP GET /health");
  addCommonHeaders();

  const uint32_t freeHeapKb = ESP.getFreeHeap() / 1024;
  const uint32_t uptimeSec = millis() / 1000;
  String body = "{\"status\":\"ok\",\"ssid\":\"" + String(ssid) +
                "\",\"ip\":\"" + WiFi.softAPIP().toString() +
                "\",\"board\":\"" + boardName() +
                "\",\"chipModel\":\"" + String(ESP.getChipModel()) +
                "\",\"chipRevision\":" + String(ESP.getChipRevision()) +
                ",\"hardwareId\":\"" + runtimeHardwareId + "\"" +
                ",\"heapKb\":" + String(freeHeapKb) +
                ",\"uptimeSec\":" + String(uptimeSec) +
                ",\"locked\":" +
                String(loadNodeSecurityKey().isEmpty() ? "false" : "true") +
                ",\"clients\":" + String(WiFi.softAPgetStationNum()) +
                ",\"configCount\":" + String(configList.size()) +
                ",\"maxConfig\":" + String(MAX_SENSORS) +
                ",\"nodeId\":" + String(runtimeSettings.nodeId) +
                ",\"latitude\":" + String(runtimeSettings.latitude, 6) +
                ",\"longitude\":" + String(runtimeSettings.longitude, 6) +
                ",\"distance\":" + String(runtimeSettings.distanceMeters, 1) +
                ",\"priority\":\"" + SmartPacket::priorityLabel(currentPriority) + "\"" +
                ",\"reportMode\":\"" + SmartPacket::reportModeLabel(currentReportMode) + "\"" +
                ",\"pendingQueue\":" + String(pendingPackets.size()) + "}";

  server.send(200, "application/json", body);
}

void handleOptions() {
  Serial.println("HTTP OPTIONS /config");
  addCommonHeaders();
  server.send(200, "text/plain", "");
}

void handleGetConfig() {
  Serial.println("HTTP GET /config");
  if (!requireAuthorizedNodeKey(false)) {
    return;
  }

  prefs.begin(configNamespace, true);
  String json = prefs.getString(configJsonPrefKey, "{\"config\":[]}");
  prefs.end();

  addCommonHeaders();
  server.send(200, "application/json", json);
}

void handlePostConfig() {
  Serial.println("HTTP POST /config");
  if (!requireAuthorizedNodeKey(true)) {
    return;
  }

  addCommonHeaders();

  if (!server.hasArg("plain")) {
    server.send(400, "application/json", "{\"status\":\"no body\"}");
    return;
  }

  String body = server.arg("plain");
  Serial.println("Received new config from app:");
  Serial.println(body);

  DynamicJsonDocument doc(4096);
  DeserializationError error = deserializeJson(doc, body);

  if (error) {
    Serial.print("JSON parse failed: ");
    Serial.println(error.f_str());
    server.send(400, "application/json", "{\"status\":\"parse error\"}");
    return;
  }

  if (!doc.containsKey("config")) {
    server.send(400, "application/json", "{\"status\":\"missing config key\"}");
    return;
  }

  loadRuntimeSettingsFromDocument(doc);
  JsonArray arr = doc["config"];
  applyConfig(arr);
  metadataSyncPending = true;

  prefs.begin(configNamespace, false);
  prefs.putString(configJsonPrefKey, body);
  prefs.end();

  String nodeKey = loadNodeSecurityKey();
  if (nodeKey.isEmpty()) {
    saveNodeSecurityKey(readRequestSecurityKey());
    Serial.println("Security key saved to node.");
  }

  // Handle secure keys from Flutter deploy payload
  if (doc.containsKey("keys") && doc["keys"].is<JsonObject>()) {
    JsonObject keysObj = doc["keys"];
    if (keysObj.containsKey("aes128") && keysObj["aes128"].is<const char*>()) {
      String aesKey = keysObj["aes128"].as<String>();
      if (saveAesKey(aesKey)) {
        Serial.println("AES key updated from deploy payload");
      }
    }
    if (keysObj.containsKey("auth") && keysObj["auth"].is<const char*>()) {
      String authKey = keysObj["auth"].as<String>();
      if (saveAuthKey(authKey)) {
        Serial.println("Auth key updated from deploy payload");
      }
    }
  }

  Serial.println("Config applied and saved to flash.");
  server.send(200, "application/json", "{\"status\":\"ok\"}");
}

void handleNotFound() {
  Serial.print("HTTP 404: ");
  Serial.println(server.uri());
  addCommonHeaders();
  server.send(
      404,
      "application/json",
      "{\"status\":\"not found\",\"hint\":\"use /, /health or /config\"}");
}

// ================= LORA & SMART COMMUNICATION =================

void appendSegment(std::vector<SensorSegment> &segments, int pin, const String &sensorName, const String &rawValue) {
  SensorSegment segment;
  segment.pin = pin;
  segment.sensorName = sensorName;
  segment.rawValue = rawValue;
  segment.segment = String(pin) + "=" + sensorName + "=" + rawValue;
  segments.push_back(segment);
}

void sampleSensors() {
  std::vector<SensorSegment> sampledSegments;
  uint8_t highestPriority = SmartPacket::PRIORITY_LOW;

  for (size_t i = 0; i < configList.size(); i++) {
    auto c = configList[i];

    if (c.sensor == "DHT22" && dhtSensors[i]) {
      float temp = dhtSensors[i]->readTemperature();
      float humidity = dhtSensors[i]->readHumidity();
      String tempValue = isnan(temp) ? "nan" : String(temp, 1);
      String humidityValue = isnan(humidity) ? "nan" : String(humidity, 1);

      appendSegment(sampledSegments, c.pin, "Temperature", tempValue);
      appendSegment(sampledSegments, c.pin, "Humidity", humidityValue);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Temperature", tempValue));
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Humidity", humidityValue));
    } else if (c.sensor == "WaterTemp" && tempSensors[i]) {
      tempSensors[i]->requestTemperatures();
      String value = String(tempSensors[i]->getTempCByIndex(0), 1);
      appendSegment(sampledSegments, c.pin, "WaterTemp", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("WaterTemp", value));
    } else if (c.sensor == "pH") {
      String value = String(readPH(analogRead(c.pin)), 2);
      appendSegment(sampledSegments, c.pin, "pH", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("pH", value));
    } else if (c.sensor == "TDS") {
      String value = String(readTDS(analogRead(c.pin)), 2);
      appendSegment(sampledSegments, c.pin, "TDS", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("TDS", value));
    } else if (c.sensor == "Turbidity") {
      String value = readTurbidity(analogRead(c.pin));
      appendSegment(sampledSegments, c.pin, "Turbidity", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Turbidity", value));
    } else if (c.sensor == "Rain") {
      String value = String(digitalRead(c.pin));
      appendSegment(sampledSegments, c.pin, "Rain", value);
      highestPriority = escalatePriority(highestPriority, classifySensorPriority("Rain", value));
    }
  }

  latestSegments = sampledSegments;
  updateReportMode(highestPriority);
}

