hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node/src/Aquaponic_LoRa_Transmitter.cpp
String buildPlainPayload(uint32_t sequence, uint8_t priority, uint8_t reportMode) {
  String payload = "auth=" + runtimeAuthKey + "&";

  for (size_t i = 0; i < latestSegments.size(); i++) {
    payload += latestSegments[i].segment + "&";
  }

  payload += "hardware_id=" + runtimeHardwareId;
  payload += "&seq=" + String(sequence);
  payload += "&priority=" + SmartPacket::priorityLabel(priority);
  payload += "&mode=" + SmartPacket::reportModeLabel(reportMode);
  payload += "&sample_ms=" + String(SAMPLE_INTERVAL_MS);
  payload += "&report_ms=" + String(currentReportIntervalMs);
  return payload;
}

String buildLocationSyncPayload(uint32_t sequence) {
  String payload = "auth=" + runtimeAuthKey;
  payload += "&meta=location";
  payload += "&hardware_id=" + runtimeHardwareId;
  payload += "&seq=" + String(sequence);
  payload += "&lat=" + String(runtimeSettings.latitude, 6);
  payload += "&lon=" + String(runtimeSettings.longitude, 6);
  payload += "&distance=" + String(runtimeSettings.distanceMeters, 1);
  return payload;
}

void fillNonce(uint8_t nonce[SmartPacket::NONCE_SIZE], uint32_t sequence) {
  memset(nonce, 0, SmartPacket::NONCE_SIZE);
  uint32_t now = millis();
  uint32_t randomValue = esp_random();
  uint32_t nodeId = runtimeSettings.nodeId;
  memcpy(nonce, &sequence, sizeof(sequence));
  memcpy(nonce + 4, &now, sizeof(now));
  memcpy(nonce + 8, &randomValue, sizeof(randomValue));
  memcpy(nonce + 12, &nodeId, sizeof(nodeId));
}

std::vector<uint8_t> encryptCtrPayload(const String &plainText, const uint8_t nonce[SmartPacket::NONCE_SIZE]) {
  std::vector<uint8_t> output(plainText.length(), 0);
  std::vector<uint8_t> nonceCounter(SmartPacket::NONCE_SIZE, 0);
  memcpy(nonceCounter.data(), nonce, SmartPacket::NONCE_SIZE);

  size_t ncOffset = 0;
  unsigned char streamBlock[16] = {0};

  mbedtls_aes_context aes;
  mbedtls_aes_init(&aes);
  mbedtls_aes_setkey_enc(&aes, reinterpret_cast<const unsigned char *>(runtimeAesKey.c_str()), 128);
  mbedtls_aes_crypt_ctr(
      &aes,
      plainText.length(),
      &ncOffset,
      nonceCounter.data(),
      streamBlock,
      reinterpret_cast<const unsigned char *>(plainText.c_str()),
      output.data());
  mbedtls_aes_free(&aes);

  return output;
}

std::vector<uint8_t> buildStructuredPacket(const String &plainText, uint8_t priority, uint8_t reportMode, uint32_t sequence) {
  uint8_t nonce[SmartPacket::NONCE_SIZE];
  fillNonce(nonce, sequence);
  std::vector<uint8_t> encryptedPayload = encryptCtrPayload(plainText, nonce);

  SmartPacket::Header header;
  header.magic = SmartPacket::MAGIC;
  header.version = SmartPacket::VERSION;
  header.nodeId = runtimeSettings.nodeId;
  header.priority = priority;
  header.reportMode = reportMode;
  header.payloadLength = (uint16_t) encryptedPayload.size();
  header.sequence = sequence;

  size_t bodyLength = sizeof(SmartPacket::Header) + SmartPacket::NONCE_SIZE + encryptedPayload.size();
  std::vector<uint8_t> packet(bodyLength + sizeof(uint32_t), 0);
  size_t offset = 0;

  memcpy(packet.data() + offset, &header, sizeof(header));
  offset += sizeof(header);
  memcpy(packet.data() + offset, nonce, SmartPacket::NONCE_SIZE);
  offset += SmartPacket::NONCE_SIZE;
  memcpy(packet.data() + offset, encryptedPayload.data(), encryptedPayload.size());
  offset += encryptedPayload.size();

  uint32_t checksum = SmartPacket::crc32(packet.data(), offset);
  memcpy(packet.data() + offset, &checksum, sizeof(checksum));
  return packet;
}

bool sendBinaryPacket(const std::vector<uint8_t> &packetBytes) {
  if (!loraReady) {
    return false;
  }

  LoRa.beginPacket();
  size_t written = LoRa.write(packetBytes.data(), packetBytes.size());
  int result = LoRa.endPacket();
  LoRa.receive();
  return written == packetBytes.size() && result == 1;
}

String getFieldValue(const String &data, const String &key) {
  int start = 0;
  const String prefix = key + "=";
  while (true) {
    int amp = data.indexOf('&', start);
    if (amp == -1) amp = data.length();

    String segment = data.substring(start, amp);
    if (segment.startsWith(prefix)) {
      return segment.substring(prefix.length());
    }

    if (amp >= data.length()) break;
    start = amp + 1;
  }
  return "";
}

bool decryptStructuredPacket(const std::vector<uint8_t> &input, SmartPacket::Header &header, String &payload) {
  const size_t minimumLength = sizeof(SmartPacket::Header) + SmartPacket::NONCE_SIZE + sizeof(uint32_t);
  if (input.size() < minimumLength) {
    return false;
  }

  memcpy(&header, input.data(), sizeof(SmartPacket::Header));
  if (header.magic != SmartPacket::MAGIC || header.version != SmartPacket::VERSION) {
    return false;
  }

  const size_t expectedLength = sizeof(SmartPacket::Header) + SmartPacket::NONCE_SIZE + header.payloadLength + sizeof(uint32_t);
  if (input.size() != expectedLength) {
    return false;
  }

  const size_t checksumOffset = input.size() - sizeof(uint32_t);
  uint32_t receivedChecksum = 0;
  memcpy(&receivedChecksum, input.data() + checksumOffset, sizeof(receivedChecksum));
  uint32_t calculatedChecksum = SmartPacket::crc32(input.data(), checksumOffset);
  if (receivedChecksum != calculatedChecksum) {
    return false;
  }

  const uint8_t *nonce = input.data() + sizeof(SmartPacket::Header);
  const unsigned char *encryptedPayload = input.data() + sizeof(SmartPacket::Header) + SmartPacket::NONCE_SIZE;

  std::vector<unsigned char> output(header.payloadLength, 0);
  std::vector<unsigned char> nonceCounter(SmartPacket::NONCE_SIZE, 0);
  memcpy(nonceCounter.data(), nonce, SmartPacket::NONCE_SIZE);
  size_t ncOffset = 0;
  unsigned char streamBlock[16] = {0};

  mbedtls_aes_context aes;
  mbedtls_aes_init(&aes);
  mbedtls_aes_setkey_enc(&aes, reinterpret_cast<const unsigned char *>(runtimeAesKey.c_str()), 128);
  mbedtls_aes_crypt_ctr(
      &aes,
      header.payloadLength,
      &ncOffset,
      nonceCounter.data(),
      streamBlock,
      encryptedPayload,
      output.data());
  mbedtls_aes_free(&aes);

  payload = "";
  for (size_t i = 0; i < output.size(); i++) {
    payload += (char) output[i];
  }
  payload.trim();
  return payload.length() > 0;
}

void handleIncomingControl() {
  if (!loraReady) return;

