hyelif/Smart-Communication-Framework/firmware_esp32/ESP32_Node/src/Aquaponic_LoRa_Transmitter.cpp
  int packetSize = LoRa.parsePacket();
  if (packetSize <= 0) return;

  std::vector<uint8_t> received(packetSize, 0);
  LoRa.readBytes(received.data(), packetSize);

  SmartPacket::Header header = {};
  String decrypted;
  if (!decryptStructuredPacket(received, header, decrypted)) {
    return;
  }

  if (getFieldValue(decrypted, "auth") != runtimeAuthKey) {
    return;
  }

  if (getFieldValue(decrypted, "cmd") != "relay") {
    return;
  }

  int relayId = getFieldValue(decrypted, "relay").toInt();
  int state = getFieldValue(decrypted, "state").toInt();
  uint32_t commandId = (uint32_t) getFieldValue(decrypted, "command_id").toInt();

  // Relay mapping: relay_id is the index of configured DO pins (sorted by pin).
  std::vector<int> relayPins;
  for (size_t i = 0; i < configList.size(); i++) {
    if (configList[i].type == "DO") {
      relayPins.push_back(configList[i].pin);
    }
  }
  std::sort(relayPins.begin(), relayPins.end());

  String status = "failed";
  String message = "relay not found";
  int appliedPin = -1;
  if (relayId >= 0 && relayId < (int) relayPins.size()) {
    appliedPin = relayPins[(size_t) relayId];
    pinMode(appliedPin, OUTPUT);
    digitalWrite(appliedPin, state ? HIGH : LOW);
    status = "done";
    message = "ok";
  }

  uint32_t seq = packetSeq++;
  String ack = "auth=" + runtimeAuthKey;
  ack += "&ack=relay";
  ack += "&hardware_id=" + runtimeHardwareId;
  ack += "&seq=" + String(seq);
  ack += "&command_id=" + String(commandId);
  ack += "&status=" + status;
  ack += "&relay=" + String(relayId);
  ack += "&pin=" + String(appliedPin);
  ack += "&state=" + String(state ? 1 : 0);
  ack += "&msg=" + message;

  std::vector<uint8_t> ackPacket = buildStructuredPacket(
      ack,
      SmartPacket::PRIORITY_HIGH,
      SmartPacket::REPORT_MODE_ABNORMAL,
      seq);
  sendBinaryPacket(ackPacket);
}

void enqueuePendingPacket(const std::vector<uint8_t> &packetBytes, uint8_t priority, uint8_t reportMode, uint32_t sequence) {
  if (pendingPackets.size() >= MAX_PENDING_PACKETS) {
    pendingPackets.erase(pendingPackets.begin());
  }

  PendingPacket packet{packetBytes, priority, reportMode, sequence, millis()};
  if (priority == SmartPacket::PRIORITY_HIGH) {
    pendingPackets.insert(pendingPackets.begin(), packet);
  } else {
    pendingPackets.push_back(packet);
  }
}

void retryPendingPacketsIfNeeded() {
  if (pendingPackets.empty() || millis() - lastRetryMs < RETRY_INTERVAL_MS) {
    return;
  }

  lastRetryMs = millis();
  PendingPacket packet = pendingPackets.front();
  if (sendBinaryPacket(packet.bytes)) {
    Serial.print("Retried queued packet successfully. Seq=");
    Serial.println(packet.sequence);
    pendingPackets.erase(pendingPackets.begin());
  } else {
    Serial.print("Queued packet retry failed. Seq=");
    Serial.println(packet.sequence);
  }
}

void sendCurrentTelemetry(bool forceImmediate) {
  if (latestSegments.empty()) {
    return;
  }

  bool intervalElapsed = (millis() - lastReportMs) >= currentReportIntervalMs;
  if (!forceImmediate && !intervalElapsed) {
    return;
  }

  uint32_t sequence = packetSeq++;
  String plainText = buildPlainPayload(sequence, currentPriority, currentReportMode);
  std::vector<uint8_t> packetBytes = buildStructuredPacket(plainText, currentPriority, currentReportMode, sequence);

  if (sendBinaryPacket(packetBytes)) {
    lastReportMs = millis();
    criticalDispatchPending = false;
    Serial.println("\n========== LORA PACKET ==========");
    Serial.print("Sequence: ");
    Serial.println(sequence);
    Serial.print("Priority: ");
    Serial.println(SmartPacket::priorityLabel(currentPriority));
    Serial.print("Report mode: ");
    Serial.println(SmartPacket::reportModeLabel(currentReportMode));
    Serial.print("Payload length: ");
    Serial.println(plainText.length());
    Serial.print("Packet length: ");
    Serial.println(packetBytes.size());
    Serial.println("Packet sent securely.");
    Serial.println("=================================\n");
  } else {
    Serial.println("LoRa send failed. Queueing packet.");
    enqueuePendingPacket(packetBytes, currentPriority, currentReportMode, sequence);
  }
}

void sendLocationSyncIfNeeded() {
  if (!metadataSyncPending) {
    return;
  }

  uint32_t sequence = packetSeq++;
  String payload = buildLocationSyncPayload(sequence);
  std::vector<uint8_t> packetBytes = buildStructuredPacket(
      payload,
      SmartPacket::PRIORITY_LOW,
      SmartPacket::REPORT_MODE_NORMAL,
      sequence);

  if (sendBinaryPacket(packetBytes)) {
    metadataSyncPending = false;
    Serial.println("Location sync packet sent after config update.");
  } else {
    enqueuePendingPacket(packetBytes, SmartPacket::PRIORITY_LOW, SmartPacket::REPORT_MODE_NORMAL, sequence);
    Serial.println("Location sync packet queued for retry.");
  }
}

// ================= SENSOR CALIBRATION FUNCTIONS =================
// These are default calibration values - adjust based on your sensor

// pH Sensor Calibration
// Default: Neutral pH7 = 1500 raw, Acid pH4 = 1000 raw, Alkaline pH10 = 2000 raw
// Formula: pH = ((raw - neutralRaw) / slope) + 7
float readPH(int raw) {
  // ESP32 ADC: 0-4095, typically pH7 reads around half (2048)
  // Calibration values - adjust these for your sensor!
  const float neutralRaw = 1500.0;  // Raw value at pH 7
  const float slope = 250.0;       // Raw change per pH unit

  float ph = ((raw - neutralRaw) / slope) + 7.0;

  // Clamp to valid range
  if (ph < 0) ph = 0;
  if (ph > 14) ph = 14;

  return ph;
}

// TDS Sensor Calibration
// Default: 0 raw = 0 PPM, 4095 raw = ~2000 PPM
// Formula: PPM = (raw / 4095.0) * 2000 * multiplier
float readTDS(int raw) {
  // Typical conversion: 1 unit ADC ~ 0.5 PPM
  // For 0-4095 ADC range mapping to 0-2000 PPM
  const float multiplier = 0.5;

  float tds = (raw / 4095.0) * 2000.0 * multiplier;

  return tds;
}

// Turbidity Sensor
// Returns NTU value and status text
String readTurbidity(int raw) {
  // ESP32: 0 = clear (high voltage), 4095 = murky (low voltage)
  // Map raw ADC to NTU (Nephelometric Turbidity Units)
  // Typical: 0 ADC = ~0 NTU (clear), 4095 ADC = ~3000 NTU (very murky)

